step-by-step/030-populate-database/1000.xml

<?xml version="1.0" ?>
<!-- Создаем коммутатор доступа в библиотеке устройств -->
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Header>
        <auth xmlns="http://ws.base.kernel.bgbilling.bitel.ru/" pswd="admin" user="admin"></auth>
    </S:Header>
    <S:Body>
        <ns5:deviceUpdate xmlns:common="http://common.bitel.ru"
                          xmlns:ns5="http://service.common.api.inet.modules.bgbilling.bitel.ru/"
                          xmlns:xs="http://www.w3.org/2001/XMLSchema"
                          xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <arg0 xmlns="" deviceGroupIds="1" deviceTypeId="2" entityId="0" entitySpecId="0" id="-1" ident="10.252.0.32"
                  orderManagerDisabled="false" parentId="1" title="10.252.0.32" xsi:type="ns5:invDevice">
                <entityAttributes></entityAttributes>
                <comment></comment>
                <config></config>
                <host>10.252.0.32:23</host>
                <password>admin</password>
                <secret></secret>
                <username>admin</username>
            </arg0>
        </ns5:deviceUpdate>
    </S:Body>
</S:Envelope>